## DataFrame con Pandas

In [3]:
#crear un dataframe con 3 columnas, nombre, edad y ciudad
import pandas as pd
data = {'Nombre': ['Juan', 'Ana', 'Pedro'],
        'Edad': [25, 30, 35],
        'Ciudad': ['Madrid', 'Barcelona', 'Valencia']}
df = pd.DataFrame(data)
# Incorporar columna salario al dataframe
df['Salario'] = [1000, 2000, 3000]
df

  Nombre  Edad     Ciudad  Salario
0   Juan    25     Madrid     1000
1    Ana    30  Barcelona     2000
2  Pedro    35   Valencia     3000

In [4]:
# Sumar 2000 a cada uno de los registros
df['Salario'] = df['Salario']+2000
df

  Nombre  Edad     Ciudad  Salario
0   Juan    25     Madrid     3000
1    Ana    30  Barcelona     4000
2  Pedro    35   Valencia     5000

In [5]:
# Edad mayor a...
mayores_25 = df[df['Edad']>25]
mayores_25

  Nombre  Edad     Ciudad  Salario
1    Ana    30  Barcelona     4000
2  Pedro    35   Valencia     5000

* Trabajar con DataFrames de Pandas 1

Crea un DataFrame llamado libros_df con la siguiente información sobre libros:

    Los títulos son: "El Quijote", "Cien años de soledad", "La odisea"

    Los autores son "Miguel de Cervantes", "Gabriel García Márquez", "Homero"

    Los años de publicación son 1605, 1967, y -800, respectivamente.

    Asegúrate de utilizar las columnas Titulo, Autor y Año.

In [6]:
libros_df = pd.DataFrame({'Titulo':["El Quijote", "Cien años de soledad", "La odisea"],
                          'Autor':["Miguel de Cervantes", "Gabriel García Márquez", "Homero"],
                          'Año':[1605,1967,-800]})

* Trabajar con DataFrames de Pandas 3

Partiendo del DataFrame df mencionado anteriormente:

    # Datos proporcionados
    data = {
        'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
        'Edad': [25, 30, 22, 27],
        'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
    }

Realiza las siguientes operaciones:

    Crea un dataframe llamado df

    Agrega una nueva columna llamada Edad_en_10_años que contenga la edad de las personas dentro de 10 años.

    Modifica la columna Ciudad para que todas las ciudades estén en mayúsculas.

    Crea una nueva columna Es_Mayor_de_25 que contenga valores booleanos: True si la persona tiene 25 años o más, y False en caso contrario.

In [13]:
    # Datos proporcionados
import pandas as pd
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}
# Columna con la edad de las personas en 10 años
df = pd.DataFrame(data)
df['Edad_en_10_años'] = df['Edad']+10

# Pasar todas las ciudades a mayísculas
df['Ciudad'] = df['Ciudad'].str.upper()

# Nueva columna Booleana que indica si la persona tiene más de 25 años
df['Es_mayor_de_25'] = df['Edad']>=25
df

   Nombre  Edad     Ciudad  Edad_en_10_años  Es_mayor_de_25
0     Ana    25     MADRID               35            True
1    Luis    30  BARCELONA               40            True
2  Carlos    22   VALENCIA               32           False
3    Sara    27     BILBAO               37            True